#ifndef _VX_FILE_H_
#define _VX_FILE_H_

#include <ioLib.h>
#include <UsrLib.h>
#include <stat.h>
#include <dirent.h>
#include <vxWorks.h>
#include <ctype.h>

#include "platform.h"
#include "syscfg.h"
#include "sysdefs.h"

//文件头
#define	MAX_FILE_LEN			204800				//2//200K
#define FILE_NEEDDOWNLOAD      ((WORD)(0x01<<0))    //文件需向下同步
#define FILE_HAVEDOWNLOAD      ((WORD)(0x01<<1))    //文件已向下同步
#define FILE_MAGIC_INIT			0x494E4954			//init
#define FILE_MAGIC_MODI			0x4F504449			//modi

typedef struct
{
	DWORD			dwSize;				//总长度		
	WORD			wVersion;			//版本号		
	WORD			wFlag;				//操作标志	D0：=1 需要同步模块文件，
										//				=0 不需同步模块文件
										//			D1：=1 已同步模块，
										//				=0 未同步模块
	DWORD			dwMagic;			//修改掩码,记录文件是否进行过修改
	TSysTime		stTime;				//修改时间	
	DWORD			dwCheck;			//文件头校验,采用累加和校验
}TFileHead;

/*************************************************************************************
* 定义文件操作标记及操作结果                                                          
*************************************************************************************/
#define FILE_HEAD        0x01
#define FILE_END         0x02
#define FILE_OK          0x04
#define FILE_ERROR       0x08

/*************************************************************************************
* 定义磁盘分区，根据需要分为2个，分别存放程序和数据                                                          
*************************************************************************************/
#define CODE_PARTITION		"/tffs0/"		//用来保存程序
#define DATA_PARTITION		"/tffs1/"		//用来保存数据

/*************************************************************************************
* 定义数据磁盘分区的各个目录                                                          
*************************************************************************************/
#define LCD_DIR				"/tffs0/para/"		//保存与LCD相关的文件
#define PARA_DIR			"/tffs0/para/"		//所有参数文件目录
#define DATA_DIR			"/tffs1/dat/"		//数据文件目录
	//#define TRANSIENT_DIR 	"/tffs1/trans/" 	//故障录波数据文件目录
#define TEMP_DIR			"/tffs0/temp/"		//临时文件目录
#define OTHERS_DIR			"/tffs0/para/"		//其它文件目录
#define IEC61850_DIR		"/tffs0/iec/"		//61850文件目录

/*************************************************************************************
* 读文件                                                          
*************************************************************************************/
DWORD VX_ReadFile( char * filename, DWORD offset, DWORD length, BYTE *buf, DWORD *len, WORD control );

/*************************************************************************************
* 写文件                                                          
*************************************************************************************/
DWORD VX_WriteFile( char * filename, DWORD offset, DWORD length, BYTE *buf, WORD type, WORD control );

/*************************************************************************************
* 删除文件                                                          
*************************************************************************************/
DWORD VX_DeleteFile( char * filename, WORD control );

/*************************************************************************************
* 获取文件长度                                                          
*************************************************************************************/
BOOL VX_GetFileLength( char *filename, DWORD *filesize );

/*************************************************************************************
* 创建目录                                                          
*************************************************************************************/
DWORD VX_MkDir( char * dirname);

/*************************************************************************************
* 删除目录                                                          
*************************************************************************************/
DWORD VX_DeleteDir( char * dirname );

/*************************************************************************************
* 读参数文件                                                          
*************************************************************************************/
DWORD VX_ReadParaFile( char *filename, BYTE *buf, DWORD *len );

/*************************************************************************************
* 读参数文件头                                                          
*************************************************************************************/
DWORD VX_ReadFileHead( char *filename, TFileHead *fileheader );

/*************************************************************************************
* 写参数文件头                                                          
*************************************************************************************/
DWORD VX_WriteParaFile( char *filename, BYTE *buf, DWORD len );

/*************************************************************************************
* 写参数文件头                                                          
*************************************************************************************/
DWORD VX_WriteFileHead( char *filename, TFileHead fileheader );

/*************************************************************************************
* 读参数文件头标志信息                                                          
*************************************************************************************/
DWORD VX_GetMagic(char *filename,DWORD &magic);

/*************************************************************************************
* 写参数文件头标志信息                                                          
*************************************************************************************/
DWORD VX_SetMagic(char *filename,DWORD magic);

/*************************************************************************************
* 取代码分区根目录(即磁盘分区)名称                                                          
*************************************************************************************/
void VX_GetCodeDir( char *dir );

/*************************************************************************************
* 取数据分区根目录(即磁盘分区)名称                                                          
*************************************************************************************/
void VX_GetDataDir( char *dir );

/*************************************************************************************
* 根据文件名恢复出带目录的全文件名                                                          
*************************************************************************************/
BOOL ToFullName( char *filename, char *fullname );


#endif
