/*************************************************************************
* 
*   版权所有(C) 天津凯发电气股份有限公司(KeyVia).
* 
*************************************************************************/

/*************************************************************************
* 
*   文件名称：
*			HmiMSGDefs.h
* 
*   软件模块：Hmi消息映射
*
* 
*	描述: Hmi窗口信息交换的消息定义
* 
* 
* 
*   函数
*
*
*	修改历史
* 
*		修改人		修改日期		修改内容
* 
*		kangqian	2008-5-16		初始创建
* 
*************************************************************************/
/*                                                                                  */
/*      通用监控平台的任务之间的信息交换的消息定义                                  */

#ifndef __HmiMSGDefs_H
#define __HmiMSGDefs_H



//@enum EHMIMessage{ 
//@    HMILBN_SELCHANGE=101,      //列表选项改变
//@    HMIWM_PAINT,          //向数据库中写一批连续的遥信数据
//@    HMIWM_ENTER,          //向数据库中写一批连续的电度数据
//@};
/**********************/

#endif /* __HmiMSGDefs_H */
